payalneg/esp32p4-android-auto/tools/bt_agent/sdkconfig.defaults
# Target ESP32 (original chip — has Classic BT). For ESP32-WROOM-32.
CONFIG_IDF_TARGET="esp32"

# --- Bluetooth Classic + SPP ---
# We are a "car kit" that pairs with the phone over Classic BT, then runs the
# Android Auto wireless setup protocol over RFCOMM (SPP). Phone discovers us
# during pairing, opens our SPP server, and we exchange Wifi credentials so it
# knows where to find the head unit on the LAN.
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_SPP_ENABLED=y
CONFIG_BT_SSP_ENABLED=y
# Custom SDP records (we need this to advertise the AA Wireless UUID
# alongside the default SPP record).
CONFIG_BT_SDP_COMMON_ENABLED=y

# HFP Hands-Free role — pretending to be a car kit so the phone considers
# us a "useful" Bluetooth peer that auto-reconnects after BT toggle and
# keeps the link up long enough for gearhead to re-check BTCapsStore on
# a *bonded* ACL_CONNECTED. We never actually route call audio.
CONFIG_BT_HFP_ENABLE=y
CONFIG_BT_HFP_CLIENT_ENABLE=y
CONFIG_BT_HFP_AG_ENABLE=n
# HCI audio data path (simpler — no PCM codec hardware to wire up).
CONFIG_BT_HFP_AUDIO_DATA_PATH_HCI=y
# Don't explicitly disable GATT — Bluedroid build assumes GATT symbols exist
# even with BR/EDR-only controller. Leaving them at default (enabled but
# inert) avoids "msg_len undeclared" errors in gatt_main.c.

# Allow up to 2 concurrent BR/EDR ACL connections (phone + dev console). One
# is enough in production.
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=2

# Default log level — verbose enough to debug pairing without drowning UART.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Use the single-app-large table (1.5 MiB app slot) for headroom — the
# default 1 MiB cuts it close once BT+SPP+HFP are linked. No OTA needed
# for the BT agent.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
